import RPi.GPIO as GPIO
import time

# กำหนดขา GPIO (ใช้โหมด BCM คือเรียกตามชื่อ GPIO 17)
FLAME_PIN = 17 

GPIO.setmode(GPIO.BCM)
GPIO.setup(FLAME_PIN, GPIO.IN)

print("เริ่มการตรวจจับเปลวไฟ... (กด Ctrl+C เพื่อหยุด)")

try:
    while True:
        # อ่านค่าจากขา DO
        # ปกติเซนเซอร์พวกนี้: เจอไฟ = 0 (Low), ไม่เจอ = 1 (High)
        if GPIO.input(FLAME_PIN) == GPIO.LOW:
            print("🔥 อันตราย! ตรวจพบไฟไหม้!")
        else:
            print("✅ สถานการณ์ปกติ")
            
        time.sleep(0.5) # หน่วงเวลา 0.5 วินาที

except KeyboardInterrupt:
    print("\nจบการทำงาน")
    GPIO.cleanup()